app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        render json: {status: 200, tweets: Tweet.all}

INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Fake news"], ["content", "I won the lottery"], ["author", "Jorge Soto"], ["created_at", "2021-02-23 23:14:17.931207"], ["updated_at", "2021-02-23 23:14:17.931207"]]
---
    def create
        tweet = Tweet.new(tweet_params)

        if tweet.save

UPDATE "tweets" SET "title" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["title", "NOT Fake news!!"], ["updated_at", "2021-02-23 23:17:42.062611"], ["id", 3]]
---
      def update
        @tweet.update(tweet_params)

DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 3]]
---
    def destroy
        @tweet.destroy()

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def get_tweet
        @tweet = Tweet.find(params[:id])